In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([8,9,5,4],index = ['a','b','c','d'])
obj2

a    8
b    9
c    5
d    4
dtype: int64

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2['c']

5

In [8]:
obj2['d']

4

In [9]:
obj2[['a','d']]

a    8
d    4
dtype: int64

In [10]:
obj2['c'] = 10
obj2

a     8
b     9
c    10
d     4
dtype: int64

In [11]:
obj2[['a','d']] = [11,98]
obj2

a    11
b     9
c    10
d    98
dtype: int64

In [12]:
obj[0:2]

0    1
1    2
dtype: int64

In [13]:
obj2['a':'c']

a    11
b     9
c    10
dtype: int64

In [14]:
obj2[obj2>10]

a    11
d    98
dtype: int64

In [15]:
obj2 * 2

a     22
b     18
c     20
d    196
dtype: int64

In [16]:
obj2 = obj2 * 2
obj2

a     22
b     18
c     20
d    196
dtype: int64

In [17]:
np.exp(obj2)

a    3.584913e+09
b    6.565997e+07
c    4.851652e+08
d    1.323483e+85
dtype: float64

In [18]:
obj2

a     22
b     18
c     20
d    196
dtype: int64

In [19]:
'b' in obj2

True

In [20]:
'e' in obj2

False

In [21]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = pd.Series(sdata,index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj3)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [26]:
pd.notnull(obj3)

Ohio      True
Texas     True
Oregon    True
Utah      True
dtype: bool

In [27]:
# isnull as an instance
obj3.isnull()

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [28]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj4.name = 'population'
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      1
Steve    2
Jeff     3
Ryan     4
dtype: int64

In [32]:
data = {'states':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002,2005],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
data

{'states': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2005],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [33]:
frame = pd.DataFrame(data)
frame

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2005  3.2

In [34]:
frame.head()

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
frame = pd.DataFrame(data,columns=['year','states','pop'])
frame

   year  states  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2005  Nevada  3.2

In [36]:
frame2 = pd.DataFrame(data,columns=['year','states','pop'],index=['one','two','three','four','five','six'])
frame2

       year  states  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2005  Nevada  3.2

In [37]:
frame2.columns

Index(['year', 'states', 'pop'], dtype='object')

In [38]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [39]:
frame2['states']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: states, dtype: object

In [40]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2005
Name: year, dtype: int64

In [41]:
frame2['year']['one']

2000

In [42]:
dates = pd.date_range('20220822', periods=6)
dates

DatetimeIndex(['2022-08-22', '2022-08-23', '2022-08-24', '2022-08-25',
               '2022-08-26', '2022-08-27'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns = list('ABCD'))
df

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [44]:
pd.date_range('20220822', periods=6, freq= "min" )

DatetimeIndex(['2022-08-22 00:00:00', '2022-08-22 00:01:00',
               '2022-08-22 00:02:00', '2022-08-22 00:03:00',
               '2022-08-22 00:04:00', '2022-08-22 00:05:00'],
              dtype='datetime64[ns]', freq='T')

In [45]:
dic = {"A":1.0,"B":pd.Timestamp('20020822'),'C':pd.Series(1,index = list(range(4)),dtype='float32'),'D':
      np.array([3]*4, dtype = 'int32'),'E':pd.Categorical(["test", "train", "test", "train"]),'F':'foo' }
dic

{'A': 1.0,
 'B': Timestamp('2002-08-22 00:00:00'),
 'C': 0    1.0
 1    1.0
 2    1.0
 3    1.0
 dtype: float32,
 'D': array([3, 3, 3, 3]),
 'E': ['test', 'train', 'test', 'train']
 Categories (2, object): ['test', 'train'],
 'F': 'foo'}

In [46]:
df2 = pd.DataFrame(dic)
df2

     A          B    C  D      E    F
0  1.0 2002-08-22  1.0  3   test  foo
1  1.0 2002-08-22  1.0  3  train  foo
2  1.0 2002-08-22  1.0  3   test  foo
3  1.0 2002-08-22  1.0  3  train  foo

In [47]:
df.head()

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570

In [48]:
df.tail(3)

                   A         B         C         D
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [49]:
df.index

DatetimeIndex(['2022-08-22', '2022-08-23', '2022-08-24', '2022-08-25',
               '2022-08-26', '2022-08-27'],
              dtype='datetime64[ns]', freq='D')

In [50]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [51]:
df.to_numpy()

array([[-1.46252351,  0.76234506,  1.24121771, -0.04607615],
       [-0.66815126, -2.15016092, -0.57852336, -1.34486395],
       [ 2.01783828,  2.15953932, -0.20117562, -0.6402216 ],
       [-0.94390034,  0.30885184,  0.39959578,  0.79965159],
       [ 0.47440251,  0.10119166, -1.78780454,  0.50756996],
       [-0.80387942, -0.736423  ,  0.08845665, -0.43988118]])

In [52]:
df2.to_numpy()

array([[1.0, Timestamp('2002-08-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2002-08-22 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2002-08-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2002-08-22 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [53]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.231036  0.074224 -0.139706 -0.193970
std    1.272716  1.447955  1.016112  0.785555
min   -1.462524 -2.150161 -1.787805 -1.344864
25%   -0.908895 -0.527019 -0.484186 -0.590136
50%   -0.736015  0.205022 -0.056359 -0.242979
75%    0.188764  0.648972  0.321811  0.369158
max    2.017838  2.159539  1.241218  0.799652

In [54]:
df.sort_index(axis = 1 ,ascending = False)

                   D         C         B         A
2022-08-22 -0.046076  1.241218  0.762345 -1.462524
2022-08-23 -1.344864 -0.578523 -2.150161 -0.668151
2022-08-24 -0.640222 -0.201176  2.159539  2.017838
2022-08-25  0.799652  0.399596  0.308852 -0.943900
2022-08-26  0.507570 -1.787805  0.101192  0.474403
2022-08-27 -0.439881  0.088457 -0.736423 -0.803879

In [55]:
df.sort_index(axis = 0 ,ascending = False)

                   A         B         C         D
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-22 -1.462524  0.762345  1.241218 -0.046076

In [56]:
df.sort_values(by = "B")

                   A         B         C         D
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-24  2.017838  2.159539 -0.201176 -0.640222

In [57]:
df['A']

2022-08-22   -1.462524
2022-08-23   -0.668151
2022-08-24    2.017838
2022-08-25   -0.943900
2022-08-26    0.474403
2022-08-27   -0.803879
Freq: D, Name: A, dtype: float64

In [58]:
df['20220822':'20220825']

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652

In [59]:
df[0:3]

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222

In [60]:
df.loc[dates[0]]
df

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [61]:
df.loc[dates[0]]

A   -1.462524
B    0.762345
C    1.241218
D   -0.046076
Name: 2022-08-22 00:00:00, dtype: float64

In [62]:
df.loc[:,['A','B']]

                   A         B
2022-08-22 -1.462524  0.762345
2022-08-23 -0.668151 -2.150161
2022-08-24  2.017838  2.159539
2022-08-25 -0.943900  0.308852
2022-08-26  0.474403  0.101192
2022-08-27 -0.803879 -0.736423

In [63]:
df.iloc[0:3,0]

2022-08-22   -1.462524
2022-08-23   -0.668151
2022-08-24    2.017838
Freq: D, Name: A, dtype: float64

In [64]:
df.loc['20220822':'20220825',['A']]

                   A
2022-08-22 -1.462524
2022-08-23 -0.668151
2022-08-24  2.017838
2022-08-25 -0.943900

In [65]:
df.loc['20220822',['A','B']]

A   -1.462524
B    0.762345
Name: 2022-08-22 00:00:00, dtype: float64

In [66]:
df.loc[dates[0],'A']

-1.4625235132513217

In [67]:
df.iloc[3]

A   -0.943900
B    0.308852
C    0.399596
D    0.799652
Name: 2022-08-25 00:00:00, dtype: float64

In [68]:
df.iloc[0:3,0]

2022-08-22   -1.462524
2022-08-23   -0.668151
2022-08-24    2.017838
Freq: D, Name: A, dtype: float64

In [69]:
df

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [70]:
df.iloc[[0,2,4],:]

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-26  0.474403  0.101192 -1.787805  0.507570

In [71]:
df.iloc[[0,2,4],[0,2]]

                   A         C
2022-08-22 -1.462524  1.241218
2022-08-24  2.017838 -0.201176
2022-08-26  0.474403 -1.787805

In [72]:
df.iloc[1,1]

-2.150160924781053

In [73]:
df

                   A         B         C         D
2022-08-22 -1.462524  0.762345  1.241218 -0.046076
2022-08-23 -0.668151 -2.150161 -0.578523 -1.344864
2022-08-24  2.017838  2.159539 -0.201176 -0.640222
2022-08-25 -0.943900  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [74]:
df.loc['20220822':'20220825','A'] = 5

In [75]:
df

                   A         B         C         D
2022-08-22  5.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000 -2.150161 -0.578523 -1.344864
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [78]:
df.iat[1,1] = 3

In [79]:
df

                   A         B         C         D
2022-08-22  5.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000  3.000000 -0.578523 -1.344864
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [83]:
df[df['A'] > 0]

                   A         B         C         D
2022-08-22  5.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000  3.000000 -0.578523 -1.344864
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570

In [84]:
df[df > 0]

                   A         B         C         D
2022-08-22  5.000000  0.762345  1.241218       NaN
2022-08-23  5.000000  3.000000       NaN       NaN
2022-08-24  5.000000  2.159539       NaN       NaN
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192       NaN  0.507570
2022-08-27       NaN       NaN  0.088457       NaN

In [85]:
df2 = df.copy()

In [86]:
df2['E'] = ['one','one','two','three','four','five']

In [87]:
df2

                   A         B         C         D      E
2022-08-22  5.000000  0.762345  1.241218 -0.046076    one
2022-08-23  5.000000  3.000000 -0.578523 -1.344864    one
2022-08-24  5.000000  2.159539 -0.201176 -0.640222    two
2022-08-25  5.000000  0.308852  0.399596  0.799652  three
2022-08-26  0.474403  0.101192 -1.787805  0.507570   four
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881   five

In [88]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2022-08-24  5.000000  2.159539 -0.201176 -0.640222   two
2022-08-26  0.474403  0.101192 -1.787805  0.507570  four

In [90]:
s1 = pd.Series([1,2,3,4,5,6],index = pd.date_range('20220824',periods=6))
s1

2022-08-24    1
2022-08-25    2
2022-08-26    3
2022-08-27    4
2022-08-28    5
2022-08-29    6
Freq: D, dtype: int64

In [91]:
df

                   A         B         C         D
2022-08-22  5.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000  3.000000 -0.578523 -1.344864
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2022-08-22 to 2022-08-27
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 412.0 bytes

In [95]:
dates[0]

Timestamp('2022-08-22 00:00:00', freq='D')

In [99]:
df.at[dates[0],'A'] = 0

In [100]:
df.iat[1,3] = 2
df

                   A         B         C         D
2022-08-22  0.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000  3.000000 -0.578523  2.000000
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [103]:
df2.set_index(pd.Series([0,1,2,3,4,5]))

          A         B         C         D      E
0  5.000000  0.762345  1.241218 -0.046076    one
1  5.000000  3.000000 -0.578523 -1.344864    one
2  5.000000  2.159539 -0.201176 -0.640222    two
3  5.000000  0.308852  0.399596  0.799652  three
4  0.474403  0.101192 -1.787805  0.507570   four
5 -0.803879 -0.736423  0.088457 -0.439881   five

In [104]:
df

                   A         B         C         D
2022-08-22  0.000000  0.762345  1.241218 -0.046076
2022-08-23  5.000000  3.000000 -0.578523  2.000000
2022-08-24  5.000000  2.159539 -0.201176 -0.640222
2022-08-25  5.000000  0.308852  0.399596  0.799652
2022-08-26  0.474403  0.101192 -1.787805  0.507570
2022-08-27 -0.803879 -0.736423  0.088457 -0.439881

In [105]:
df.value_counts()

A          B          C          D
-0.803879  -0.736423   0.088457  -0.439881    1
 0.000000   0.762345   1.241218  -0.046076    1
 0.474403   0.101192  -1.787805   0.507570    1
 5.000000   0.308852   0.399596   0.799652    1
            2.159539  -0.201176  -0.640222    1
            3.000000  -0.578523   2.000000    1
dtype: int64

In [106]:
df['A'] = np.nan

In [107]:
df

             A         B         C         D
2022-08-22 NaN  0.762345  1.241218 -0.046076
2022-08-23 NaN  3.000000 -0.578523  2.000000
2022-08-24 NaN  2.159539 -0.201176 -0.640222
2022-08-25 NaN  0.308852  0.399596  0.799652
2022-08-26 NaN  0.101192 -1.787805  0.507570
2022-08-27 NaN -0.736423  0.088457 -0.439881

In [108]:
df.isna()

               A      B      C      D
2022-08-22  True  False  False  False
2022-08-23  True  False  False  False
2022-08-24  True  False  False  False
2022-08-25  True  False  False  False
2022-08-26  True  False  False  False
2022-08-27  True  False  False  False

In [109]:
df.isna().sum()

A    6
B    0
C    0
D    0
dtype: int64

In [110]:
len(df)

6

In [111]:
df.isna().sum() / len(df) * 100

A    100.0
B      0.0
C      0.0
D      0.0
dtype: float64